run-SNOWPACKFoam/BYL-tundra-2015-2016-noHet-drift/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 1.36736;

boundaryField
{
    top
    {
        /*
        type            fixedGradient;
        gradient           uniform 0;
        */
        
        /*        		
        type            fixedValue;
        value           uniform 0.001071335;
        */
        
        type            zeroGradient;        
    }

    bottom
    {
		/*
        type            fixedGradient;
        gradient           uniform 0; 
        */
             		
        /*
        type            fixedValue;
        value           uniform 0.004835396;
        */

        type            zeroGradient;                
    }

    left
    {
        type            cyclic;
        //type            zeroGradient;                                             
    }

    right
    {
        type            cyclic;
        //type            zeroGradient;                        
    }

    frontAndBack
    {
        type empty;
    } 
}

// ************************************************************************* //
